<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jss.Cyberduck</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Productivity</string>
		<key>NAME</key>
		<string>Cyberduck</string>
		<key>SELFSERVE_POLICY</key>
		<string>Cyberduck</string>
		<key>SMART_GROUP</key>
		<string>*LEAVE_OUT*</string>
		<key>arb_group_name</key>
		<string>autopkg Test</string>
		<key>SPARKLE_FEED_URL</key>
		<string>http://version.cyberduck.ch/changelog.rss</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.jss.Cyberduck</string>
</dict>
</plist>
