<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jss.Firefox</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Internet Browsers</string>
		<key>LOCALE</key>
		<string>en_US</string>
		<key>NAME</key>
		<string>Firefox</string>
		<key>RELEASE</key>
		<string>latest</string>
		<key>SELFSERVE_POLICY</key>
		<string>Firefox</string>
		<key>SMART_GROUP</key>
		<string>*LEAVE_OUT*</string>
		<key>arb_group_name</key>
		<string>autopkg Test</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.jss.Firefox</string>
</dict>
</plist>
