<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jss.Flux</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Utilities</string>
		<key>NAME</key>
		<string>Flux</string>
		<key>SELFSERVE_POLICY</key>
		<string>Flux</string>
		<key>SMART_GROUP</key>
		<string>*LEAVE_OUT*</string>
		<key>arb_group_name</key>
		<string>autopkg Test</string>
		<key>SPARKLE_FEED_URL</key>
		<string>https://herf.org/flux/macflux.xml</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mfcalan.jss.Flux</string>
</dict>
</plist>
