<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jss.Handbrake</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>APPLICATIONS</string>
		<key>DESCRIPTION</key>
		<string>HandBrake is a tool for converting video from nearly any format to a selection of modern, widely supported codecs.</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>%RECIPE_DIR%/SmartGroupAllManagedClients.xml</string>
		<key>ICON</key>
		<string>%RECIPE_DIR%/Handbrake.png</string>
		<key>NAME</key>
		<string>HandBrake</string>
		<key>POLICY_CATEGORY</key>
		<string>APPLICATIONS</string>
		<key>POLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/PolicyTemplate.xml</string>
		<key>SU_FEED_URL</key>
		<string>http://handbrake.fr/appcast.x86_64.xml</string>

	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.jss.Handbrake</string>
</dict>
</plist>
