<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jss.MSOffice2011Updates</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Software Updates</string>
		<key>CULTURE_CODE</key>
		<string>0409</string>
		<key>NAME</key>
		<string>Microsoft Office 2011 Update</string>
		<key>SELFSERVE_POLICY</key>
		<string>Microsoft Office 2011 Update</string>
		<key>SMART_GROUP</key>
		<string>*LEAVE_OUT*</string>
		<key>arb_group_name</key>
		<string>autopkg Test</string>
		<key>VERSION</key>
		<string>latest</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.jss.MSOffice2011Updates</string>
</dict>
</plist>
