<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads Adobe Flash Player installer and extracts the embedded package, uploads to JSS.</string>
        <key>Identifier</key>
        <string>com.github.mfcalan.jss.FlashPlayerExtractPackage</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>AdobeFlashPlayer</string>
            <key>CATEGORY</key>
            <string>PLUGINS-DRIVERS</string>
            <key>POLICY_CATEGORY</key>
            <string>PLUGINS-DRIVERS</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/AdobeFlashPlayerPolicy.xml</string>
            <key>GROUP_NAME</key>
            <string>Adobe Flash Player-update-smart</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/SmartGroupAllManagedClients.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/AdobeFlashPlayer.png</string>
            <key>DESCRIPTION</key>
            <string>Install Adobe Flash Player</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.pkg.FlashPlayerExtractPackage</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                    <key>extension_attributes</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>AdobeFlashVersion</string>
                            <key>ext_attribute_path</key>
                            <string>%RECIPE_DIR%/AdobeFlashPlayerExtensionAttribute.xml</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
