<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Updates the JSS smart groups for Adobe Acrobat Pro XI</string>
	<key>Identifier</key>
	<string>com.github.mfcalan.jss.AdobeAcrobatProXIUpdateSmartGroup</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_VERSION</key>
		<string>11</string>
		<key>VERSION</key>
		<string>latest</string>
		<key>NAME</key>
		<string>Adobe Acrobat Pro XI</string>
       	<key>JSS_INVENTORY_NAME</key>
        <string>Adobe Acrobat Pro.app</string>
		<key>CATEGORY</key>
		<string>SOFTWARE UPDATES</string>
        <key>GROUP_NAME</key>
        <string>Autopkg: %NAME% - Needs update</string>
        <key>SECOND_GROUP_NAME</key>
        <string>Autopkg: %NAME% - Autoupdate</string>
        <key>GROUP_TEMPLATE</key>
        <string>%RECIPE_DIR%/AdobeAcrobatProXISmartGroup.xml</string>
        <key>GROUP_TEMPLATE2</key>
        <string>%RECIPE_DIR%/AdobeAcrobatProXISmartGroupAutoUpdate.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.mfcalan.pkg.AdobeAcrobatProXIUpdate</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>version</key>
				<string>%version%</string>
				<key>jss_inventory_name</key>
				<string>%JSS_INVENTORY_NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
					<dict>
                        <key>name</key>
                        <string>%SECOND_GROUP_NAME%</string>
                        <key>smart</key>
                        <true/>
                        <key>template_path</key>
                        <string>%GROUP_TEMPLATE2%</string>
                    </dict>
				</array>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>