<policy>
    <general>
        <name>Adobe Acrobat Pro XI Update</name>
        <enabled>true</enabled>
        <trigger_other>AdobeAcrobatProXIUpdate</trigger_other>
        <frequency>Ongoing</frequency>
        <category>
            <name>ADOBE</name>
        </category>
        <site>
            <id>5</id>
            <name>Portland</name>
        </site>
    </general>
    <scope>
		<!--Scope added by JSSImporter-->
    </scope>
    <package_configuration>
		<!--Package added by JSSImporter-->
    </package_configuration>
    <scripts>
		<!--Scripts added by JSSImporter-->
    </scripts>
    <self_service>
        <use_for_self_service>true</use_for_self_service>
		<install_button_text>Install</install_button_text>
		<self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
    </self_service>
    <maintenance>
        <recon>true</recon>
    </maintenance>
</policy>
