<policy>
    <general>
        <name>%PROD_NAME%</name>
        <enabled>true</enabled>
        <trigger_other>Excel</trigger_other>
        <frequency>Ongoing</frequency>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
        <site>
            <id>5</id>
            <name>Portland</name>
        </site>
    </general>
    <scope>
		<!--Scope added by JSSImporter-->
    </scope>
    <package_configuration>
		<!--Package added by JSSImporter-->
    </package_configuration>
    <scripts>
        <scripts>
    <size>1</size>
        <script>
            <id>328</id>
            <name>pdx.Set.Office.2016.DefaultSave.To.Local</name>
            <priority>After</priority>
        </script>
    </scripts>
    <self_service>
        <use_for_self_service>true</use_for_self_service>
        <install_button_text>Install</install_button_text>
        <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
    </self_service>
    <maintenance>
        <recon>true</recon>
    </maintenance>
    <files_processes>
        <run_command>jamf policy -trigger MSOffice2016Licensing</run_command>
    </files_processes>
</policy>
