<policy>
    <general>
        <name>Microsoft Office 2016</name>
        <enabled>true</enabled>
        <trigger_other>MSOffice2016</trigger_other>
        <frequency>Ongoing</frequency>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
        <site>
            <id>5</id>
            <name>Portland</name>
        </site>
    </general>
    <scope>
        <!--Scope added by JSSImporter-->
    </scope>
    <package_configuration>
        <!--Package added by JSSImporter-->
    </package_configuration>
    <scripts>
    	<size>1</size>
    	<script>
      	  <id>327</id>
      	  <name>PDX : Apps : Install MS Office 2016</name>
      	  <priority>After</priority>
      	  <parameter4/>
      	  <parameter5/>
      	  <parameter6/>
      	  <parameter7/>
      	  <parameter8/>
      	  <parameter9/>
      	  <parameter10/>
      	  <parameter11/>
    	</script>
    </scripts>
    <self_service>
        <use_for_self_service>true</use_for_self_service>
        <install_button_text>Install</install_button_text>
        <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
    </self_service>
    <maintenance>
        <recon>true</recon>
    </maintenance>
</policy>
