<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads latest Silverlight installer, copies the package to the build directory with an appended version number, and uploads to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.mfcalan.jss.Silverlight</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Silverlight</string>
            <key>CATEGORY</key>
            <string>PLUGINS-DRIVERS</string>
            <key>POLICY_CATEGORY</key>
            <string>PLUGINS-DRIVERS</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/Silverlight.png</string>
            <key>GROUP_NAME</key>
            <string>%NAME%-update-smart</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/SmartGroupAllManagedClients.xml</string>
            <key>DESCRIPTION</key>
			<string>Install Silverlight</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.pkg.Silverlight</string>
        <key>Process</key>
        <array>
            <!--The parent recipe results in a bundle-style package, which can be
            problematic for non-AFP repos; eventually fix to wrap in a flat-pkg
        -->
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>version</key>
					<string>%version%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION% Install %prod_name% %version%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                    <key>extension_attributes</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>SilverlightVersion</string>
                            <key>ext_attribute_path</key>
                            <string>%RECIPE_DIR%/SilverlightExtensionAttribute.xml</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
