<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Cyberduck and builds a package, then uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github.mfcalan.jss.Cyberduck</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>APPLICATIONS</string>
		<key>GROUP_NAME</key>
		<string>Computers: PDX All Managed Clients</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupAllManagedClients.xml</string>
		<key>NAME</key>
		<string>Cyberduck</string>
		<key>POLICY_CATEGORY</key>
		<string>APPLICATIONS</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Cyberduck is an open source client for FTP and SFTP, WebDAV, OpenStack Swift, and Amazon S3.</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.mfcalan.pkg.Cyberduck</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
                <key>version</key>
				<string>%version%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION% Install %prod_name% %version%.</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
