<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Updates JSS update smart group.</string>
        <key>Identifier</key>
        <string>com.github.mfcalan.jss.Cyberduck</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Cyberduck</string>
            <key>CATEGORY</key>
            <string>APPLICATIONS</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/UpdateSmartGroup.xml</string>
            <key>GROUP_NAME</key>
            <string>Autopkg: %NAME%-update</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.pkg.Cyberduck</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>version</key>
					<string>%version%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
